0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 10);

boundaryField
{
  outlet
    {
      type            fixedValue;
      value           uniform (0 0 0);
    }
  inlet
    {
      type            fixedValue;
      value           uniform (0 0 0);
    }
  ring_1
    {
      type            fixedValue;
      value           uniform (0 0 0);
    }
  ring_2
    {
      type            fixedValue;
      value           uniform (0 0 0);
    }
  ring_3
    {
      type            fixedValue;
      value           uniform (0 0 0);
    }
  ring_4
    {
      type            fixedValue;
      value           uniform (0 0 0);
    }
  pt
    {
      type            fixedValue;
      value           uniform (0 0 0);
    }
  walls
    {
      type            empty;
    }
}

// ************************************************************************* //
