0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 533.67;

boundaryField
{
    outlet
    {
        type            zeroGradient;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 533.67;
    }
    ring_1
    {
        type            fixedValue;
        value           uniform 594.67;
    }
    ring_2
    {
        type            fixedValue;
        value           uniform 594.67;
    }
    ring_3
    {
        type            fixedValue;
        value           uniform 594.67;
    }
    ring_4
    {
        type            fixedValue;
        value           uniform 594.67;
    }
    pt
    {
      //type zeroGradient;
      type            fixedValue;
      value           uniform 533.67;
    }
      walls
      {
	type            empty;
      }
}

// ************************************************************************* //
