0/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [1 -3 0 0 0 0 0];


internalField   uniform 1.1e3;

boundaryField
{
    outlet
      {
	type            fixedValue;
        value           uniform 0;
      }
    inlet
      {
	type            fixedValue;
	value           uniform 0;
      }
    ring_1
      {
        type            fixedValue;
        value           uniform 0;
      }
    ring_2
      {
        type            fixedValue;
        value           uniform 0;
      }
    ring_3
      {
        type            fixedValue;
        value           uniform 0;
      }
    ring_4
      {
        type            fixedValue;
        value           uniform 0;
      }
    pt
      {
        type            fixedValue;
        value           uniform 0;
      }
    walls
      {
	type empty;
      }
}

// ************************************************************************* //
